import * as wiki from './wikificator';
import { Eyo, safeDictionary } from 'eyo-kernel';

const safeEyo = new Eyo();
safeEyo.dictionary.set(safeDictionary);

/**
 * Типографиктор и ёфикатор
 * @param text 
 * @returns 
 */
export function processText(text: string): string {
    // console.log('processText');

    // python3 autoformat.py --pre |
    text = processTextPre(text);
    // js wikificator.js |
    text = wiki.Wikify(text);
    // js node_modules/eyo/bin/cli.js --stdin |
    text = safeEyo.restore(text);
    // python3 autoformat.py --post
    text = processTextPost(text);

    return text;
}

/**
 * Считает количество слов или что-то похожее на слова
 * @param str 
 * @returns 
 */
export function countWords(str: string): number {
    var matches = str.match(/[a-zа-яё'-]+/gi);
    return matches ? matches.length : 0;
}

function processTextPre(text: string): string {
    // console.log('processTextPre');

    function r(r1: string | RegExp, r2: any) {
        text = text.replace(r1, r2);
    }

    text = '\n' + text + '\n';

    // Использован \P{L} (любой НЕ буквенный символ) вместо \b, так как \b не работает с кириллицей

    const P = '[Кк]то|[Чч]то|[Кк]ак|[Кк]ак\\p{L}{2,3}|[Гг]де|[Чч]ем|[Чч]ей|[Чч]ему|[Чч]его|[Кк]уда|[Кк]ому|[Кк]ого|[Зз]ачем|[Кк]огда';

    // кое-
    r(new RegExp(`(?<=\\P{L})([Кк]о[ей]) (${P})(?=\\P{L})`, 'gu'), '$1-$2');

    // -либо
    r(new RegExp(`(?<=\\P{L})(${P}|[Оо]ткуда|[Пп]очему|[Оо]тчего) ([Лл]ибо)(?=\\P{L})`, 'gu'), '$1-$2');

    // -то
    r(new RegExp(`(?<=\\P{L})(${P}|[Тт]ак|[Кк]ои|[Оо]бщем|[Пп]очему|[Вв]ообще|[Нн]аконец) ([Тт]о)(?=\\P{L})`, 'gu'), '$1-$2');

    // давным-давно
    r(/(?<=\P{L})([Дд]авным) ([Дд]авно)(?=\P{L})/gu, '$1-$2');

    // во-первых, во-вторых
    r(/(?<=\P{L})([Вв]о) ([Пп]ервых|[Вв]торых)(?=\P{L})/gu, '$1-$2');

    // из-за, из-под
    r(/(?<=\P{L})([Ии]з) ([Зз]а|[Пп]од)(?=\P{L})/gu, '$1-$2');

    // не-а
    r(/(?<=\P{L})([Нн]е)([Аа])(?=\P{L})/gu, '$1-$2');

    // как-никак
    r(/(?<=\P{L})([Кк]ак) ([Нн]икак)(?=\P{L})/gu, '$1-$2');

    // более-менее
    r(/(?<=\P{L})([Бб]олее) ([Мм]енее)(?=\P{L})/gu, '$1-$2');

    // строго-настрого
    r(/(?<=\P{L})([Сс]трого) ([Нн]астрого)(?=\P{L})/gu, '$1-$2');

    // просто-напросто
    r(/(?<=\P{L})([Пп]росто) ([Нн]апросто)(?=\P{L})/gu, '$1-$2');

    // крест-накрест
    r(/(?<=\P{L})([Кк]рест) ([Нн]акрест)(?=\P{L})/gu, '$1-$2');

    // худо-бедно
    r(/(?<=\P{L})([Хх]удо) ([Бб]едно)(?=\P{L})/gu, '$1-$2');

    // точь-в-точь
    r(/(?<=\P{L})([Тт]очь) ([Вв]) ([Тт]очь)(?=\P{L})/gu, '$1-$2-$3');

    // м-да
    r(/(?<=\P{L})([Мм])([Дд]а)(?=\P{L})/gu, '$1-$2');

    // -таки (всё-таки, довольно-таки)
    r(/(?<=\P{L})([Вв]с[её]|[Дд]овольно) ([Тт]аки)(?=\P{L})/gu, '$1-$2');

    // -нибудь
    r(/(?<=\P{L})(\S+) ([Нн]ибудь)(?=\P{L})/gu, '$1-$2');

    // -ка
    r(/(?<=\P{L})(\S+) ([Кк]а)(?=\P{L})/gu, '$1-$2');

    // no hyphen: конце-концов → конце концов
    r(/(?<=\P{L})([Кк])онце-концов(?=\P{L})/gu, '$1онце концов');

    // удаление дефиса перед частицами: бы, же, ли, уж, лишь
    r(/-(бы|же|ли|уж|лишь|[Бб]ы|[Жж]е|[Лл]и|[Уу]ж|[Лл]ишь)(?=\P{L})/gu, ' $1');

    // что-ж → что ж
    r(/(?<=\P{L})([Чч]то)-?ж(?=\P{L})/gu, '$1 ж');

    // бок-о-бок → бок о бок
    r(/(?<=\P{L})([Бб])ок-о-бок(?=\P{L})/gu, '$1ок о бок');

    // не уж то → неужто
    r(/(?<=\P{L})([Нн])е уж то(?=\P{L})/gu, '$1еужто');

    // ёфикация: все → всё
    r(/(?<=\P{L})([Вв])се (еще|ещё|ж|же|равно|так же)(?=\P{L})/gu, '$1сё $2');
    r(/(?<=\P{L})([Вв])се-таки(?=\P{L})/gu, '$1сё-таки');
    r(/(?<=\P{L})([Вв])се-равно(?=\P{L})/gu, '$1сё равно');
    r(/(?<=\P{L})([Оо]) чем(?=\P{L})/gu, '$1 чём');

    // то есть, → то есть (убираем запятую)
    r(/(?<=\P{L})([Тт])о есть,(?=\P{L})/gu, '$1о есть');

    // автозамена популярных опечаток
    r(/(?<=\P{L})С подряд(?=\P{L})/gu, 'Подряд');
    r(/(?<=\P{L})с подряд(?=\P{L})/gu, 'подряд');
    r(/(?<=\P{L})Схмурив(?=\P{L})/gu, 'Нахмурив');
    r(/(?<=\P{L})схмурив(?=\P{L})/gu, 'нахмурив');

    r(/(?<=\P{L})([Нн])еспеша(?=\P{L})/gu, '$1е спеша');
    r(/(?<=\P{L})([Чч])ерез чур(?=\P{L})/gu, '$1ересчур');
    r(/(?<=\P{L})([Пп])еред до мной(?=\P{L})/gu, '$1ередо мной');
    r(/(?<=\P{L})([Тт])оли(?=\P{L})/gu, '$1о ли');
    r(/(?<=\P{L})([Сс])осем(?=\P{L})/gu, '$1овсем');
    r(/(?<=\P{L})([Уу])веренна(?=\P{L})/gu, '$1верена');
    r(/(?<=\P{L})([Вв])о-время(?=\P{L})/gu, '$1овремя');
    r(/(?<=\P{L})([Шш])опот(?=\P{L})/gu, '$1ёпот');
    r(/(?<=\P{L})([Лл])адо(?=\P{L})/gu, '$1адно');

    // Темнейшейство → Темнейшество
    r(/(?<=\P{L})Темнейшейство/gu, 'Темнейшество');

    // имена
    // Флатершай → Флаттершай
    r(/(?<=\P{L})Флатершай/gu, 'Флаттершай');

    // Твайлайт
    r(/(?<=\P{L})Тва[йл][йла]?[ла]?[йт][йт]/gu, 'Твайлайт');

    // Рейнбоу/Рейндбоу → Рэйнбоу
    r(/(?<=\P{L})Рейнд?боу/gu, 'Рэйнбоу');

    // Эплджек
    r(/(?<=\P{L})Эпп?лл?[Дд]жек/gu, 'Эплджек');

    // Эппл → Эпл
    r(/(?<=\P{L})Эппл/gu, 'Эпл');

    // Мундансер → Мундэнсер
    r(/(?<=\P{L})Мундансер/gu, 'Мундэнсер');

    // Бон Бон → Бон-Бон
    r(/(?<=\P{L})Бон Бон(?=\P{L})/gu, 'Бон-Бон');

    // Бель → Белль
    r(/(?<=\P{L})Бель/gu, 'Белль');

    // // Понивиллл → Понивилл (сначала три л)
    // r(/(?<=\P{L})[Пп]онивиллл/gu, 'Понивилл');

    // понивил* → Понивилл*
    r(/(?<=\P{L})[Пп]онивил(?!л)/gu, 'Понивилл');

    // Понивилльски → понивилльски
    r(/(?<=\P{L})Понивилльски/gu, 'понивилльски');

    // запятая + пробел
    r(/,(\P{L})/gu, ', $1');

    // точка + тире
    r(/\.-/gu, '. -');

    // запятая + тире
    r(/,-/gu, ', -');

    // тире + многоточие
    r(/ -…/gu, ' - …');

    // пустые теги <i>
    r(/<\/i><i>/gu, '');

    // пробелы перед </i>
    r(/\s+<\/i>/gu, '</i>');

    // множественные пробелы и переносы строк
    r(/\s*\n\s*/gu, '\n\n');

    // трамва → травма (только если дальше не "й")
    r(/(?<=\P{L})([тТ])рамва(?![й])/gu, '$1равма');

    // серъёзный → серьёзный (и любые другие слова на "серъ")
    r(/(?<=\P{L})([сС])еръ/gu, '$1ерь');

    r(/(?<=\P{L})([Вв]прочем|[Нн]аверное|[Вв]идимо|[Пп]ожалуй|[Пп]о крайней мере|[Кк]ак правило|[Сс]коре[ей] всего)([,.]?)\s*(?=\P{L})/gu, '$1, ');

    return text.trim();
}

function processTextPost(text: string): string {
    // console.log('processTextPost');

    function r(r1: string | RegExp, r2: any) {
        text = text.replace(r1, r2);
    }

    text = '\n' + text + '\n';

    // // ['] -> ударение
    // r(/\[\'\]/gu, '\u0301');

    // !… или ?… → !.. или ?..
    r(/([!?])…/gu, '$1..');
    // …! или …? → !.. или ?..
    r(/…([!?])/gu, '$1..');
    // ..! или ..? → !.. или ?..
    r(/\.\.([!?])/gu, '$1..');

    // !? или ?! — оставляем ?!
    r(/[!?]\?/gu, '?!');

    // многоточия: …... или ….. → …
    r(/…[….]+/gu, '…');

    // // нет пробелам после многоточия в начале строки
    // r(/\n…\s+/gu, '\n…');

    // fix wiki
    r(/'''(.*?)'''/gu, '<b>$1</b>');
    r(/''(.*?)''/gu, '<i>$1</i>');
    r(/<\/b><b>/gu, '');

    // бёлль → Белль
    r(/(?<=\P{L})бёлль(?=\P{L})/gu, 'Белль');

    // // * * * → ***
    // r(/\* \* \*/gu, '***');
    // r(/<center>\*\s*\*\s*\*<\/center>/gu, '***');

    // -=W=-
    r(/-=W=-/gu, '—=W=—');

    // // *** на отдельных строках
    // r(/\n\*{3}\s*\n/gu, '\n\n<center>* * *</center>\n');

    // // </center> + перенос строки
    // r(/<\/center>\n/gu, '</center>\n<tab>');

    // …- → … —
    r(/…-/gu, '… —');

    // - в начале строки → — с неразрывным пробелом
    r(/\n-/gu, '\n—\xa0');

    // <i>- в начале строки
    r(/\n<i>-\s+/gu, '\n<i>—\xa0');

    return text.trim();
}
