/*  Описание: [[ВП:Викификатор]].

	Перед изменениями регулярок протестируйте их на примерах реальных статей. Например,
	через собственное расширение [[Википедия:Викификатор#Расширения]]
	или через [[WP:AWB]] — хотя синтаксис регулярок в АВБ отличается от ВФ.
*/

export function Wikify(text: string): string {
	'use strict';

	var txt = text;

	// ФУНКЦИИ

	function r(r1: string | RegExp, r2?: any) {
		txt = txt.replace( r1, r2 );
	}

	function processText() {
		var u = '\u00A0'; // неразрывный пробел
		
		r( /\{\{\s*ref-(\w+)\s*/g, '{{ref|$1' ); // {{ref-en}} → {{ref|en}} и т. д.
		// Упрощение кода степеней: {{^5}}{{^0}}{{^3}} → {{sup|503}}. Вплоть до 9 таких цифр подряд. Больше правил о степенях будет ниже, см. "Степени".
		r( /\{\{\^(\d)\}\}\{\{\^(\d)\}\}(?:\{\{\^(\d)\}\})?(?:\{\{\^(\d)\}\})?(?:\{\{\^(\d)\}\})?(?:\{\{\^(\d)\}\})?(?:\{\{\^(\d)\}\})?(?:\{\{\^(\d)\}\})?(?:\{\{\^(\d)\}\})?/g, '{{sup|$1$2$3$4$5$6$7$8$9}}' );
		r( /[^\S\n\r]+(\n|\r)/g, '$1' ); // spaces at EOL
		r( /(^|[А-Яа-я])\u00eb([а-я]|$)/g, '$1ё$2' ); // некириллическая "ë" → кириллическая "ё"
		r( /(^|[А-Яа-я])\u00cb([а-я]|$)/g, '$1Ё$2' ); // некириллическая "Ë" → кириллическая "Ё"
		r( /\{\{\s*(?:шаблон|[шt]|template):([\s\S]+?)\}\}/gi, '{{$1}}' );
		r( /\{\{(?:подст:|subst:)?(?:[Уу]дар(?:ение)?|')\}\}/g, '\u0301' );
		r( /\s+\{\{([·•*])\}\}/g, '{{$1}}' ); // лишний пробел/строка до шаблона {{·/•/*}}
		r( /(\{\{\s*)(?:reflist|список примечаний)(\s*[\|\}])/ig, '$1примечания$2' );
		r( /(\{\{\s*)примечания(\s*\|\s*)[4-9](\s*[\|\}])/ig, '$1примечания$2узкие$3' );
		r( /(\{\{\s*)примечания\s*\|\s*height=[0-9]*(\s*[\|\}])/ig, '$1примечания$2' );
		r( /[\u00A0 ]+(\{\{\s*([Rr]ef-[a-z\-]+?|[Ee]n icon|[Cc]hecked|[Vv]|[Пп]роверено)\}\})/g, '$1' );
		r( /<[\/\\]?(hr|br)( [^\/\\>]+?)?? *[\/\\]?>/gi, '<$1$2>' );
		r( /<noinclude>\s*(\{\{[dD]ocpage\}\})\s*<\/noinclude>/g, '$1' );
		r( /(\| *(?:[сСcCsS]|pp?|страницы\d?|pages\d?|seite\d?|alleseiten|листы\d?|том|volume|band|выпуск|issue|heft|номер|столбцы\d?|columns\d?|kolonnen\d?|серия год) *= *)(\d+)[\u00A0 ]?(?:-{1,3}|—) ?(\d+)/g, '$1$2—$3' );
		r( /(\| *год *= *)(\d{4})[\u00A0 ]?(?:-{1,3}|—) ?(\d{4})/g, '$1$2—$3' );

		r( /(\[\[[^\{\]|\n]+){{!}}([^\{\]|\n]+\]\])/g, '$1|$2' );
		
		if ( txt.indexOf( '{{НП' ) > -1 ) {
			r( / *\| *(?:CoordAddon|ЯндексКарта)[^\|\}]+\n/g, '' );
			r( / *\| *размер карты (?:страны|региона|района) *= *[^\|\}]+\n/g, '' );
		}
		
		var i;
		txt = '\n' + txt + '\n';


		// Вики-ссылки
		r( /(\[\[:?)(?:категория|к|category):( *)/ig, '$1Категория:' );
		r( /(\[\[:?)(?:модуль|module):( *)/ig, '$1Модуль:' );
		r( /(\[\[:?)(?:шаблон|[шt]|template):( *)/ig, '$1Шаблон:' );
		r( /(\[\[:?)(?:file|файл|image|изображение):( *)/ig, '$1Файл:' );
		// Linked years, centuries and ranges
		r( /(\(|\s)(\[\[[12]?\d{3}\]\])[\u00A0 ]?(-{1,3}|–|—) ?(\[\[[12]?\d{3}\]\])(\W)/g, '$1$2—$4$5' );
		r( /(\[\[[12]?\d{3}\]\]) ?(гг?\.)/g, '$1' + u + '$2' );
		r( /(\(|\s)(\[\[[IVX]{1,5}\]\])[\u00A0 ]?(-{1,3}|–|—) ?(\[\[[IVX]{1,5}\]\])(\W)/g, '$1$2—$4$5' );
		r( /(\[\[[IVX]{1,5}\]\]) ?(вв?\.)/g, '$1' + u + '$2' );
		r( /(\d)\s(год)/g, '$1' + u + '$2' );
		r( /\[\[(\d+)\]\]\sгод/g, '[[$1' + u + 'год]]' );
		r( /\[\[(\d+)\sгод\|\1\]\]\sгод/g, '[[$1' + u + 'год]]' );
		r( /\[\[(\d+)\sгод\|\1\sгод([а-я]{0,3})\]\]/g, '[[$1' + u + 'год]]$2' );
		r( /\[\[((\d+)(?: (?:год )?в [\wa-яёА-ЯЁ ]+\|\2)?)\]\][\u00A0 ](год[а-яё]*)/g, '[[$1' + u + '$3]]' );
		r( /([XVI])\s(век)/g, '$1' + u + '$2' );
		r( /\[\[([XVI]+)\]\]\sвек/g, '[[$1' + u + 'век]]' );
		r( /\[\[([XVI]+)\sвек\|\1\]\]\sвек/g, '[[$1' + u + 'век]]' );
		r( /\[\[([XVI]+)\sвек\|\1\sвек([а-я]{0,3})\]\]/g, '[[$1' + u + 'век]]$2' );
		r( /\[\[(([XVI]+) век\|\2)\]\][\u00A0 ]век/g, '[[$2' + u + 'век]]' );
		// Nice links
		r( /(\[\[[^|[\]]*)[\u00AD\u200E\u200F]+([^\[\]]*\]\])/g, '$1$2' ); // Soft Hyphen & DirMark
		r( /\[\[ *([^|[\]]+?) *\| *('''''|'''|'')([^'|[\]]*)\2 *]]/g, '$2[[$1|$3]]$2' ); // вынести курсив/полужирный за пределы вики-ссылки
		r( /\[\[ *([^|[\]]+?) *\| *«([^»|[\]]*)» *\]\]/g, '«[[$1|$2]]»' ); // вынести кавычки за пределы вики-ссылки
		r( /\[\[ *([^|[\]]+?) *\| *„([^“|[\]]*)“ *\]\]/g, '„[[$1|$2]]“' );
		r( /\[\[ *([^|[\]]+?) *\| *"([^"|[\]]*)" *\]\]/g, '"[[$1|$2]]"' );
		r( /\[\[\s*([^\]\|]+?)\s*]]/g, '[[$1]]' );
		r( /\[\[ *([^|[\]]+)([^|\[\]()]+?) *\| *\1 *\]\]\2/g, '[[$1$2]]' ); // text repetition after link
		r( /\[\[ *(?!Файл:|Категория:)([a-zA-Zа-яёА-ЯЁ\u00A0-\u00FF %!\"$&'()*,\-—.\/0-9:;=?\\@\^_`’~]+) *\| *([^\|\[\]]+) *\]\]([a-zа-яё]+)/g, '[[$1|$2$3]]' ); // "


		// ТЕГИ
		r( /<<(\S.+\S)>>/g, '"$1"' ); // << >>
		r( /(su[pb]>)-(\d)/g, '$1−$2' ); // ->minus
		r( /<(b|strong)>(.*?)<\/(b|strong)>/gi, "'''$2'''" );
		r( /<(i|em)>(.*?)<\/(i|em)>/gi, "''$2''" );
		r( /^<hr ?\/?>/gim, '----' );
		r( /[\u00A0 \t]*<ref(?:\s+name="")?(\s|>)/gi, '<ref$1' );
		r( /(\n== *[a-zа-я\s\.:]+ *==\n+)<references(?: +responsive *= *"")? *\/>/ig, '$1{' + '{примечания}}' );

		r( /[ \t\u00A0]{2,}/g, ' ' ); // двойные пробелы

		r( /\(tm\)/gi, '™' );
		r( /\.\.\./g, '…' ); // три точки → многоточие (согл. [[ВП:ТГ]])
		r( /(^|[^+])\+-(?!\+|-)/g, '$1±' );
		r( /~=/g, '≈' );
		r( /((?:^|[\s"])\d+(?:[\.,]\d+)?\s*)[xх](\s*\d+(?:[\.,]\d+)?)\s*([мm]{1,2}(?:[\s"\.,;?!]|$))/g, '$1×$2' + u + '$3' );
		r( /\s+×\s+/g, u + '×' + u );
		r( /([\wа-яА-ЯёЁ])'(?=[\wа-яА-ЯёЁ])/g, '$1’' ); // ' → ’ (согл. [[ВП:ТГ]])
		r( /№№/g, '№' );
		
		// Степени. Выше есть замена шаблонов: см. "Упрощение кода степеней"
		r( /\^2([^\d\}])/g, '{{^2}}$1' ); // ^2 → {{^2}}
		r( /\^3([^\d\}])/g, '{{^3}}$1' ); // ^3 → {{^3}}
		r( /\sкв\.\s*([кмдсн]?м(?:км)?)([\s.,;:)])/g, u + '$1{{^2}}$2' ); // кв. м → {{м2}}
		r( /\sкуб\.\s*([кмдсн]?м(?:км)?)([\s.,;:)])/g, u + '$1{{^3}}$2' ); // куб. м → {{м3}}
		r( /\s([кмдсн])?м²/g, u + '{{$1м2}}' ); // м², км² и пр., кроме мкм² → {{м2}}
		r( /\sмкм²/g, u + '{{мкм2}}' ); // мкм²
		r( /\s([кмдсн])?м³/g, u + '{{$1м3}}' ); // м³, км³ и пр., кроме мкм³ → {{м3}}
		r( /\sмкм³/g, u + '{{мкм3}}' ); // мкм³
		r( /\s([кмдсн]?м(?:км)?)\{\{\^([23])\}\}([\s.,;:)])/g, u + '{{$1$2}}$3' ); // м{{^2}} → {{м2}}
		
		// Дроби
		r( /½/g, '{{1/2}}' );
		r( /¼/g, '{{1/4}}' );
		r( /¾/g, '{{3/4}}' );
		
		// Заголовки
		r( /^(=+)[ \t\f\v]*(.*?)[ \t\f\v]*=+$/gm, '$1 $2 $1' ); // add spaces inside
		r( /([^\r\n])(\r?\n==.+==\r?\n)/g, '$1\n$2' ); // add empty line before
		r( /(==.+==)[\r\n]{2,}(?!=)/g, '$1\n' ); // remove empty line after
		r( /^== (см(\.?|отр(и|ите|еть))|see) ?(также|ещ[её]|also|more) ==$/gmi, '== См. также ==' );
		r( /^== сноски ==$/gmi, '== Примечания ==' );
		r( /^== внешние\sссылки ==$/gmi, '== Ссылки ==' );
		r( /^== (?:(.+[^.])\.|(.+):) ==$/gm, '== $1$2 ==' );
		r( /^== '''(?!.*'''.*''')(.+)''' ==$/gm, '== $1 ==' );

		r( /[«»“”„]/g, '"' ); // временная замена на "

		// Hyphens and en dashes to pretty dashes
		r( /–/g, '-' ); // &ndash; -> hyphen
		r( /(\s)-{1,3} /g, '$1— ' ); // hyphen -> &mdash;
		r( /(\d)--(\d)/g, '$1—$2' ); // -> &mdash;
		r( /(\s)-(\d)/g, '$1−$2' ); // hyphen -> minus

		// Диапазоны годов и веков
		r( /([12]?\d{3}) ?(гг?\.)/g, '$1' + u + '$2' );
		r( /(\(|\s)([IVX]{1,5})[\u00A0 ]?(-{1,3}|—) ?([IVX]{1,5})(?![\w\-])/g, '$1$2—$4' );
		r( /([IVX]{1,5}) ?(вв?\.)/g, '$1' + u + '$2' );

		// Сокращения
		r( /([тТ])\.\s?е\./g, '$1о есть' );
		r( /([тТ])\.\s?к\./g, '$1ак как' );
		r( /([вВ])\sт\.\s?ч\./g, '$1 том числе' );
		r( /([иИ])\sт\.\s?д\./g, '$1' + u + 'т.' + u + 'д.' );
		r( /([иИ])\sт\.\s?п\./g, '$1' + u + 'т.' + u + 'п.' );
		r( /([тТ])\.\s?н\./g, '$1.' + u + 'н.' );
		r( /([иИ])\.\s?о\./g, '$1.' + u + 'о.' );
		r( /с\.\s?ш\./g, 'с.' + u + 'ш.' );
		r( /ю\.\s?ш\./g, 'ю.' + u + 'ш.' );
		r( /в\.\s?д\./g, 'в.' + u + 'д.' );
		r( /з\.\s?д\./g, 'з.' + u + 'д.' );
		r( /л\.\s?с\./g, 'л.' + u + 'с.' );
		r( /а\.\s?е\.\s?м\./g, 'а.' + u + 'е.' + u + 'м.' );
		r( /а\.\s?е\./g, 'а.' + u + 'е.' );
		r( /мм\sрт\.\s?ст\./g, 'мм' + u + 'рт.' + u + 'ст.' );
		r( /н\.\s?э(\.|(?=\s))/g, 'н.' + u + 'э.' );
		r( /([дД])([о.])\s?н\.\s?э\./g, '$1о' + u + 'н.' + u + 'э.' );
		r( /(\d)[\u00A0 ]?(млн|млрд|трлн|[дсмнк]?м|мкм|[км]г)\.?(?=[,;.]| "?[а-яё\-]{2,}|\s*\|)/g, '$1' + u + '$2' );
		r( /(\d)[\u00A0 ](тыс)([^\.А-Яа-яЁё])/g, '$1' + u + '$2.$3' );
		r( /(\d)\s(тыс\.)/g, '$1' + u + '$2' );
		r( /ISBN:\s?(?=[\d\-]{8,17})/, 'ISBN ' );

		// Вставка/удаление пробелов
		r( /^([#*:]+)[\u00A0 \t\f\v]*(?!\{\|)([^\u00A0 \t\f\v*#:;])/gm, '$1 $2' ); // space after #*: unless before table
		r( /(\S)[\u00A0 \t](-{1,3}|—)[\u00A0 \t](\S)/g, '$1' + u + '— $3' );
		r( /(^|[^\wА-яЁё\.])([А-ЯЁ][а-яё]+) ([А-ЯЁ]\.) ?([А-ЯЁ]\.)(?! ?[А-ЯЁ][а-яё\.])/g,'$1$2' + u + '$3' + u + '$4' ); // инициалы "Петров А. В."
		r( /(^|[^\wА-яЁё\.])([А-ЯЁ]\.) ?([А-ЯЁ]\.) ?(?=[А-ЯЁ][а-яё]+)/g, '$1$2' + u + '$3' + u); // инициалы "А. В. Петров"
		r( /([а-яё]"?\)?[\.\?!:])((?:\x01\d+\x02\|)?(?:[A-QS-ZА-ЯЁ]|R(?!u\b)))/g, '$1 $2' ); // "слово.Слово" → "слово. Слово". Не исправляет случаи по типу "Газета.Ru" (латиница в домене), но затронуло бы "Газета.Рф" → "Газета. Рф" (кириллица в домене). При необходимости можно исправить
		r( /([)"a-zа-яё\]²³])\s*([,:])([\[(a-zа-яё])/g, '$1$2 $3' ); // аналогично "слово, слово" и "слово: слово"
		r( /([)a-zа-яё\]²³])\s*([,:])"/g, '$1$2 "' );
		r( /([)"a-zа-яё\]²³])[ \u00A0\t]([,;])\s([\[("a-zа-яё])/g, '$1$2 $3' );
		r( /([^%\/\wА-Яа-яЁё"]\d+?(?:[\.,]\d+?)?) ?([%‰])(?!-[А-Яа-яЁё])/g, '$1' + u + '$2' ); // исправит на "5 %", но не затронет "5%-ный"
		r( /(\d) ([%‰])(?=-[А-Яа-яЁё])/g, '$1$2' ); //5%-й
		r( /([№§])(\s*)(\d)/g, '$1' + u + '$3' );
		// внутри скобок ()
		r( /\( +/g, '(' );
		r( / +\)/g, ')' );

		// Температура
		r( /([\s\d=≈≠≤≥<>—("'|])([+±−\-]?\d+?(?:[.,]\d+?)?)(([ °\^*]| [°\^*])(C|F))(?=[\s"').,;!?|\x01])/gm, '$1$2' + u + '°$5' ); // '

		r( /(\s\d+)\.(\d+[\u00A0 ]*[%‰°×])/gi, '$1,$2' ); // замена точки в числах на запятую
		r( /(\d) (?=\d{3}\b)/g, '$1' + u ); // 1 000 000

		// "" → «»
		for ( i = 1; i <= 2; i++ ) {
			r( /([\s\x02!|#'"\/([{;+\-])"([^"]*)([^\s"([{|])"([^a-zа-яё])/ig, '$1«$2$3»$4' ); // "
		}
		while ( /«[^»]*«/.test( txt ) ) {
			r( /«([^»]*)«([^»]*)»/g, '«$1„$2“' ); // «» внутри других «» → „“
		}
		
    // Перемещение кавычек внутрь курсива/полужирного шрифта согласно [[ВП:Кавычки]].
		
    // Но для начала надо снять курсив с кавычек, чтобы избежать ошибок вроде ''»'' → »''''.
    // Правило 0: снятие курсива с кавычек.
	//	''«''некурсивная фраза''»'' → «некурсивная фраза» (кавычкам не нужно выделение, если текст не выделен)
	//	''первая курсивная фраза'' «''вторая курсивная фраза'' → ''первая курсивная фраза «вторая курсивная фраза'' (убирает лишнее прерывание выделения, сливая два выделения в одно)
    r( /('''''|'''|'')(\s)?([«»„“])(\s)?\1/g, '$2$3$4' );
		
    // Правило 1: если все кавычки вне выделения, то пусть запрыгнут в выделение
    r( /([«„])('''''|'''|'')([^'\n]*?)\2([»“])/g, '$2$1$3$4$2' );
		
    // Правило 2: если открывающие кавычки вне выделения
    r( /([«„])('''''|'''|'')([^'\n]*?)([»“])\2/g, '$2$1$3$4$2' );
    // Правило 3: если закрывающие кавычки вне выделения
    r( /('''''|'''|'')([«„])([^'\n]*?)\1([»“])/g, '$1$2$3$4$1' );

		txt = txt.substr( 1, txt.length - 2 ); // compensation for "txt = '\n' + txt + '\n';"
	}

	processText();
	return txt;
}
